<a href="https://colab.research.google.com/github/Olcur88/kursGITSDA/blob/main/Pandas_ZDDATA11.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

pd.__version__

'1.1.5'

In [ ]:
s1 = pd.Series([1,2.5,3,np.nan,5,6])
print(s1)
print(type(s1))

0    1.0
1    2.5
2    3.0
3    NaN
4    5.0
5    6.0
dtype: float64
<class 'pandas.core.series.Series'>

In [ ]:
d1 = pd.DataFrame([[1,2,3],[4,5,6]])
display(d1)
print(type(d1))
print(d1[0])
print(type(d1[0]))

   0  1  2
0  1  2  3
1  4  5  6

<class 'pandas.core.frame.DataFrame'>
0    1
1    4
Name: 0, dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
d2 = pd.DataFrame(np.random.randn(7,3), index=[2014, 2015, 2016, 2017, 2018, 2019, 2020])
display(d2)

             0         1         2
2014 -0.231403 -0.490207  0.320751
2015 -0.108414 -1.553284  0.217714
2016  0.802464  1.413567 -0.163536
2017 -0.498852 -1.157606  0.567428
2018  0.093297  0.850935 -1.469218
2019  0.023653  0.544104  1.618589
2020 -0.598736  1.192562  1.796837

In [ ]:
dates = pd.date_range('20210424102000', periods=7)
print(dates)

DatetimeIndex(['2021-04-24 10:20:00', '2021-04-25 10:20:00',
               '2021-04-26 10:20:00', '2021-04-27 10:20:00',
               '2021-04-28 10:20:00', '2021-04-29 10:20:00',
               '2021-04-30 10:20:00'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
!git clone https://github.com/matzim95/ML-datasets

Cloning into 'ML-datasets'...
remote: Enumerating objects: 71, done.
remote: Counting objects: 100% (71/71), done.
remote: Compressing objects: 100% (59/59), done.
remote: Total 71 (delta 16), reused 59 (delta 12), pack-reused 0
Unpacking objects: 100% (71/71), done.

In [ ]:
chipotle = pd.read_csv('ML-datasets/chipotle.tsv', sep='\t')
chipotle

      order_id  ...  item_price
0            1  ...      $2.39
1            1  ...      $3.39
2            1  ...      $3.39
3            1  ...      $2.39
4            2  ...     $16.98
...        ...  ...         ...
4617      1833  ...     $11.75
4618      1833  ...     $11.75
4619      1834  ...     $11.25
4620      1834  ...      $8.75
4621      1834  ...      $8.75

[4622 rows x 5 columns]

In [ ]:
chipotle.head(3)
chipotle.tail(7)
chipotle.sample(5)
chipotle.item_price
chipotle['item_price']
chipotle[['order_id', 'item_price']]
chipotle[54:56]
chipotle.index
chipotle.columns
chipotle.info() #WAŻNE

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [ ]:
#dataframe.loc[nazwa_wiersza,nazwa_kolumny]
chipotle.loc[5,'item_price']
chipotle.loc[2:50:3,['quantity', 'item_price']]
chipotle.iloc[2:50:3,[1,4]]
chipotle.loc[:,['quantity', 'item_price']]
chipotle.loc[5,'quantity'] = chipotle.loc[5,'quantity'] -3
chipotle.loc[5,'quantity']

1

In [ ]:
chipotle = chipotle.drop('nowa_nazwa', axis=1)

In [ ]:
chipotle.quantity > 1 #zwraca True/False
chipotle[(chipotle.quantity > 1) | (chipotle.order_id > 1500)]

In [ ]:
chipotle.quantity = pd.Series(np.random.randint(3,6,4622))
chipotle

In [ ]:
chipotle['new'] = pd.Series(np.random.randint(1,1000,4622))
chipotle

      order_id  quantity  ... item_price  new
0            1         5  ...     $2.39   821
1            1         4  ...     $3.39   585
2            1         4  ...     $3.39   147
3            1         4  ...     $2.39   947
4            2         5  ...    $16.98   727
...        ...       ...  ...        ...  ...
4617      1833         3  ...    $11.75   909
4618      1833         5  ...    $11.75   565
4619      1834         5  ...    $11.25   686
4620      1834         5  ...     $8.75   246
4621      1834         5  ...     $8.75   498

[4622 rows x 6 columns]

In [ ]:
cars = pd.read_csv('ML-datasets/auto_mpg.csv', na_values='?')
cars.sample(10)
#cars.info()
cars.cylinders.count()
cars.cylinders.value_counts()
cars.weight.sum()
cars.weight.min()
cars.weight.max()
cars.max()
cars.horsepower.mean()
cars.horsepower.median()
cars.horsepower.std()
cars.describe() #WAŻNE

        cylinders  displacement  horsepower  ...   modelyear      origin         mpg
count  398.000000    398.000000  392.000000  ...  398.000000  398.000000  398.000000
mean     5.454774    193.425879  104.469388  ...   76.010050    1.572864   23.514573
std      1.701004    104.269838   38.491160  ...    3.697627    0.802055    7.815984
min      3.000000     68.000000   46.000000  ...   70.000000    1.000000    9.000000
25%      4.000000    104.250000   75.000000  ...   73.000000    1.000000   17.500000
50%      4.000000    148.500000   93.500000  ...   76.000000    1.000000   23.000000
75%      8.000000    262.000000  126.000000  ...   79.000000    2.000000   29.000000
max      8.000000    455.000000  230.000000  ...   82.000000    3.000000   46.600000

[8 rows x 8 columns]

In [ ]:
def func(x):
  return x.max() - x.min()

cars.apply(func)

In [ ]:
cars.horsepower = cars.horsepower.apply(lambda x: x+2)

In [ ]:
cars.groupby('cylinders').mean().horsepower
cars.groupby('modelyear').min().acceleration
cars.groupby('modelyear').min()[['acceleration', 'weight']]
cars.groupby('modelyear').agg(['min', 'max'])[['acceleration', 'weight']]

          acceleration        weight
                   min   max     min     max
modelyear
70                 8.0  20.5  1835.0  4732.0
71                11.5  20.5  1613.0  5140.0
72                11.0  23.5  2100.0  4633.0
73                 9.5  21.0  1867.0  4997.0
74                13.5  21.0  1649.0  4699.0
75                11.5  21.0  1795.0  4668.0
76                12.0  22.2  1795.0  4380.0
77                11.1  19.0  1825.0  4335.0
78                11.2  21.5  1800.0  4080.0
79                11.3  24.8  1915.0  4360.0
80                11.4  23.7  1835.0  3381.0
81                12.6  20.7  1755.0  3725.0
82                11.6  24.6  1965.0  3035.0

In [ ]:
print(len(cars))
cars = cars.dropna()
print(len(cars))

398
392

In [ ]:
cars = cars.drop(1)
cars

In [ ]:
cars.drop(2)

     cylinders  displacement  horsepower  ...  modelyear  origin   mpg
0            8         307.0       130.0  ...         70       1  18.0
3            8         304.0       150.0  ...         70       1  16.0
4            8         302.0       140.0  ...         70       1  17.0
5            8         429.0       198.0  ...         70       1  15.0
6            8         454.0       220.0  ...         70       1  14.0
..         ...           ...         ...  ...        ...     ...   ...
393          4         140.0        86.0  ...         82       1  27.0
394          4          97.0        52.0  ...         82       2  44.0
395          4         135.0        84.0  ...         82       1  32.0
396          4         120.0        79.0  ...         82       1  28.0
397          4         119.0        82.0  ...         82       1  31.0

[390 rows x 8 columns]

In [ ]:
cars = cars.drop('origin', axis=1)

     cylinders  displacement  horsepower  weight  acceleration  modelyear   mpg
0            8         307.0       130.0  3504.0          12.0         70  18.0
2            8         318.0       150.0  3436.0          11.0         70  18.0
3            8         304.0       150.0  3433.0          12.0         70  16.0
4            8         302.0       140.0  3449.0          10.5         70  17.0
5            8         429.0       198.0  4341.0          10.0         70  15.0
..         ...           ...         ...     ...           ...        ...   ...
393          4         140.0        86.0  2790.0          15.6         82  27.0
394          4          97.0        52.0  2130.0          24.6         82  44.0
395          4         135.0        84.0  2295.0          11.6         82  32.0
396          4         120.0        79.0  2625.0          18.6         82  28.0
397          4         119.0        82.0  2720.0          19.4         82  31.0

[391 rows x 7 columns]

In [ ]:
zoo = pd.read_csv('ML-datasets/zoo.csv')
zoo.head(3)

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550

In [ ]:
zoo = zoo.append({'animal': 'tiger', 'uniq_id': 1023, 'water_need': 800}, ignore_index=True)
zoo

In [ ]:
zoo_eats = pd.DataFrame({'animal': ['elephant', 'tiger', 'giraffe', 'zebra', 'kangaroo'],
                         'food': ['vegetables', 'meat', 'vegetables', 'vegetables', 'vegetables']})
zoo_eats

In [ ]:
zoo.merge(zoo_eats, how='inner')
zoo = zoo.merge(zoo_eats, how='outer')

In [ ]:
cars.sort_values(['cylinders'])
cars.sort_values(['cylinders'], ascending=False).reset_index(drop=True)
cars.sort_values(['cylinders', 'horsepower'], ascending=[False, True]).reset_index(drop=True)

In [ ]:
def func(x):
  if x == 'lion':
    return 'meat'
  else:
    return 'vegetables'

zoo2 = zoo.merge(zoo_eats, how='left')
zoo2.food = zoo2.food.fillna(zoo2.animal.apply(func))
zoo2

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         320        meat
5      tiger     1006         330        meat
6      tiger     1007         290        meat
7      tiger     1008         310        meat
8      zebra     1009         200  vegetables
9      zebra     1010         220  vegetables
10     zebra     1011         240  vegetables
11     zebra     1012         230  vegetables
12     zebra     1013         220  vegetables
13     zebra     1014         100  vegetables
14     zebra     1015          80  vegetables
15      lion     1016         420        meat
16      lion     1017         600        meat
17      lion     1018         500        meat
18      lion     1019         390        meat
19  kangaroo     1020         410  vegetables
20  kangaroo     1021         430  vegetables
21  kangaroo     1022         410  vegetables
22     tiger     1023         800        meat

In [ ]:
dates = pd.DataFrame({'date': [20210424,20210425,20210426]})
#dates.info()
dates.date = pd.to_datetime(dates.date, format='%Y%m%d')
#dates.info()
dates.date.dt.year
dates.date.dt.day
dates.date.dt.day_name()

0    Saturday
1      Sunday
2      Monday
Name: date, dtype: object

In [ ]:
chipotle = pd.read_csv('ML-datasets/chipotle.tsv', sep='\t')
chipotle.head(3)
#chipotle.info()

   order_id  quantity  ... choice_description item_price
0         1         1  ...                NaN     $2.39
1         1         1  ...       [Clementine]     $3.39
2         1         1  ...            [Apple]     $3.39

[3 rows x 5 columns]

In [ ]:
dolarizer = lambda x: float(x[1:])
chipotle.item_price = chipotle.item_price.apply(dolarizer)

In [ ]:
chipotle.info()
chipotle.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 180.7+ KB

   order_id  quantity  ... choice_description item_price
0         1         1  ...                NaN       2.39
1         1         1  ...       [Clementine]       3.39
2         1         1  ...            [Apple]       3.39

[3 rows x 5 columns]

In [ ]:
chipotle.groupby('order_id').sum().item_price.mean()

18.81142857142869

In [ ]:
chipotle.groupby('item_name').sum().quantity.sort_values(ascending=False)

In [ ]:
chipotle.groupby('choice_description').sum().quantity.sort_values(ascending=False)

choice_description
[Diet Coke]                                                                                                       159
[Coke]                                                                                                            143
[Sprite]                                                                                                           89
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese, Sour Cream, Lettuce]]                                             49
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese, Sour Cream]]                                                      42
                                                                                                                 ...
[Tomatillo Green Chili Salsa, [Fajita Vegetables, Pinto Beans, Cheese]]                                             1
[Tomatillo Green Chili Salsa, [Fajita Vegetables, Lettuce]]                                                         1
[Tomatillo Green Chili Salsa, [Fajita Vegetables, Cheese, Sour Cream, Lettuce]]                                     1
[Tomatillo Green Chili Salsa, [Fajita Vegetables, Cheese, Sour Cream, Guacamole, Lettuce, Rice]]                    1
[Adobo-Marinated and Grilled Chicken, Pinto Beans, [Sour Cream, Salsa, Cheese, Cilantro-Lime Rice, Guacamole]]      1
Name: quantity, Length: 1043, dtype: int64

In [ ]:
chipotle.quantity.sum()

4972

In [ ]:
revenue = (chipotle.quantity * chipotle.item_price).sum()
revenue

39237.02

In [ ]:
chipotle['revenue'] = chipotle.quantity * chipotle.item_price
chipotle

In [ ]:
chipotle.groupby('order_id').sum().revenue.mean()

21.394231188658654

In [ ]:
chipotle.item_name.value_counts().count()

50

In [ ]:
chipotle[chipotle.item_price > 40].item_name.value_counts().count()

1

In [ ]:
chipotle.groupby('item_name').max().item_price.max()

44.25

In [ ]:
drinks = pd.read_csv('ML-datasets/drinks.csv')
drinks

In [ ]:
drinks[drinks.country == "Poland"]

    country  beer_servings  ...  total_litres_of_pure_alcohol  continent
135  Poland            343  ...                          10.9         EU

[1 rows x 6 columns]

In [ ]:
drinks[drinks.continent == "EU"].sort_values(['total_litres_of_pure_alcohol'], ascending=False).reset_index(drop=True)

In [ ]:
drinks.info()

In [ ]:
drinks.continent = drinks.continent.fillna('NA')
drinks[drinks.continent.isna()]

Empty DataFrame
Columns: [country, beer_servings, spirit_servings, wine_servings, total_litres_of_pure_alcohol, continent]
Index: []

In [ ]:
drinks.groupby('continent').mean().total_litres_of_pure_alcohol

continent
AF    3.007547
AS    2.170455
EU    8.617778
NA    5.995652
OC    3.381250
SA    6.308333
Name: total_litres_of_pure_alcohol, dtype: float64

In [ ]:
drinks.groupby('continent').describe().wine_servings

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
NA          23.0   24.521739  28.266378  1.0   5.0   11.0   34.00  100.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [ ]:
cars = pd.read_csv('ML-datasets/auto_mpg.csv', na_values="?")
#cars.info()
means = cars.groupby('cylinders').mean().horsepower
means

for i in [3,4,5,6,8]:
  cars.horsepower[cars.cylinders == i] = cars.horsepower[cars.cylinders == i].fillna(means[i])

cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cylinders     398 non-null    int64
 1   displacement  398 non-null    float64
 2   horsepower    398 non-null    float64
 3   weight        398 non-null    float64
 4   acceleration  398 non-null    float64
 5   modelyear     398 non-null    int64
 6   origin        398 non-null    int64
 7   mpg           398 non-null    float64
dtypes: float64(5), int64(3)
memory usage: 25.0 KB

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [ ]:
babes = pd.read_csv('ML-datasets/US_Baby_Names_right.csv')
babes = babes.drop(['Unnamed: 0', 'Id'], axis=1)
babes

In [ ]:
babes.Gender.value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [ ]:
names = babes.groupby("Name").sum().Count
names

In [ ]:
names.sort_values(ascending=False)

Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
             ...
Janira           5
Arsalan          5
Lizvet           5
Janisha          5
Destenie         5
Name: Count, Length: 17632, dtype: int64

In [ ]:
names.max()

242874

In [ ]:
names.idxmax()

'Jacob'

In [ ]:
babes1 = babes[babes.Gender == 'F'][['Name', 'Gender']]
babes2 = babes[babes.Gender == 'M'][['Name', 'Gender']]
babes1.merge(babes2, how='inner')

Empty DataFrame
Columns: [Name, Gender]
Index: []